"""
실전
숫자 카드 게임

숫자 카드 게임은 여러 개의 숫자 카드 중에서 가장 높은 숫자가 쓰인 카드 한 장을 뽑는 게임이다.
단, 게임의 룰을 지키며 카드를 뽑아야 하고 룰은 다음과 같다.

1. 숫자가 쓰인 카드들이 N * M 형태로 놓여있다. 이때 N은 행의 개수, M은 열의 개수를 의미한다.
2. 먼저 뽑고자 하는 카드가 포함되어 있는 행을 선택한다.
3. 그다음 선택된 행에 포함된 카드들 중 가장 숫자가 낮은 카드를 뽑아야 한다.
4. 따라서 처음에 카드를 골라낼 행을 선택할 때, 이후에 해당 행에서 가장 숫자가 낮은 카드를 뽑을
것을 고려하여 최종적으로 가장 높은 숫자의 카드를 뽑을 수 있도록 전략을 세워야 한다.

예를 들어 3 * 3 형태로 카드들이 놓여있다고 하자.

여기서 카드를 골라낼 행을 고를 때 첫 번째 혹은 두 번째 행을 선택하는 경우, 최종적으로 뽑는 카드는 1이다.
하지만 세 번째 행을 선택하는 경우 최종적으로 뽑는 카드는 2이다. 따라서 이 예제에
서는 세 번째 행을 선택하여 숫자 2가 쓰여진 카드를 뽑는것이 정답이다.

카드들이 N * M 형태로 놓여 있을 때, 게임의 룰에 맞게 카드를 뽑는 프로그램을 만드시오.

첫째 줄에 숫자 카드들이 놓인 행의 개수 N과 열의 개수 M이 공백을 기준으로 하여 각각 자연수로 주어진다. (1<=N, M<=100)
둘째 줄부터 N개의 줄에 걸쳐 각 카드에 적힌 숫자가 주어진다. 각 숫자는 1이상 10000이하의 자연수이다.

입력예시 1
3 3
3 1 2
4 1 4
2 2 2

출력예시 1
2

입력예시 2
2 4
7 3 1 8
3 3 3 4

출력예시 2
3
"""

# n, m 입력받기
n, m = map(int, input().split())
# 큰 숫자 초기화
result = 0
# 행의 개수만큼의 길이를 가진 배열 생성
# card_list = [0 for i in range(n)]
# 행의 개수 만큼 반복하며 배열을 입력받음
#for idx in range(len(card_list)):
for i in range(n):
    #card_list[idx] = list(map(int, input().split()))
    data = list(map(int, input().split()))
    # 오름차순으로 정렬해서 변수에 담음
    #card_list[idx].sort()
    min_num = min(data)
    # 큰 수 비교를 통해 result에 값 저장
    #if result < card_list[idx][0]:
    #    result = card_list[idx][0]
    result = max(result, min_num)
print(result)
